app/controllers/widgets_controller.rb

  def index
    @widgets = Widget.all
---
SELECT "widgets".* FROM "widgets"

  def create
    @widget = Widget.new(widget_params)

    respond_to do |format|
      if @widget.save
---
INSERT INTO "widgets" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ritta"], ["price", "12.7"], ["created_at", "2022-03-24 17:42:02.160502"], ["updated_at", "2022-03-24 17:42:02.160502"]]

    def set_widget
      @widget = Widget.find(params[:id])
---
SELECT "widgets".* FROM "widgets" WHERE "widgets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]